/**
Copyright (c) 2019-present Lenovo
Licensed under BSD-3, see COPYING.BSD file for details."
**/   

#include "okr.h"

#include "lnkbuf.h"
#include <Protocol/NvmExpressPassthru.h >
EFI_GUID gEfiDiskInfoNvmeInterfaceGuid = {0x3ab14680, 0x5d3f, 0x4a4d, {0xbc, 0xdc, 0xcc, 0x38, 0x0, 0x18, 0xc7, 0xf7 }};

BYTE *g_seg_buffer = NULL;
BYTE *g_read_seg_buffer = NULL;


//定义内存分配释放函数，以便将来进行优化，防止碎片等
PVOID myalloc(DWORD Length)
{
    if (Length < 0x1000)
        Length = 0x1000;
    return AllocatePool(Length);
}

UINT64 CalcAliginSize( UINT64 num )
{
	UINT64	 NewAlignNum = 0;

	NewAlignNum = DivU64x32 ((num + ALGIN_SIZE_BYTE - 1), ALGIN_SIZE_BYTE);
	NewAlignNum = MultU64x32 (NewAlignNum, ALGIN_SIZE_BYTE);
	
	return NewAlignNum;
}

CHAR16 *
Ascii2Unicode (
    OUT CHAR16         *UnicodeStr,
    IN  CHAR8          *AsciiStr
)
/*++

Routine Description:
  Converts ASCII characters to Unicode.

Arguments:
  UnicodeStr - the Unicode string to be written to. The buffer must be large enough.
  AsciiStr   - The ASCII string to be converted.

Returns:
  The address to the Unicode string - same as UnicodeStr.

--*/
{
    CHAR16  *Str = NULL;
	int i =0;

	if (NULL == UnicodeStr || NULL == AsciiStr)
	{
		return NULL;
	}

    Str = UnicodeStr;

    while (AsciiStr[i]) {

        UnicodeStr[i] = (CHAR16)AsciiStr[i];
		i++;
    }
	UnicodeStr[i] = 0;

	return UnicodeStr;
}

// read file to memory (allocated),call freefilemem() later
// return NULL ,if read failed;

    IN       BYTE              *FirstString,
    IN       BYTE              *SecondString,
    INTN  num
)
{
    INTN i;
    //
    // ASSERT both strings are less long than PcdMaximumUnicodeStringLength
    //
    for (i=0;i<num;i++) {
        if (*FirstString != *SecondString)
            return 1;
        FirstString++;
        SecondString++;
    }
    return 0;
}
////////////////p//////////////////////////////
//
// -- Time Management Routines --
//

#define IsLeap(y)   (((y) % 4) == 0 && (((y) % 100) != 0 || ((y) % 400) == 0))
#define SECSPERMIN  (60)
#define SECSPERHOUR (60 * 60)
#define SECSPERDAY  (24 * SECSPERHOUR)

//
//  The arrays give the cumulative number of days up to the first of the
//  month number used as the index (1 -> 12) for regular and leap years.
//  The value at index 13 is for the whole year.
//
UINTN CumulativeDays[2][14] = {
    {
        0,
        0,
        31,
        31 + 28,
        31 + 28 + 31,
        31 + 28 + 31 + 30,
        31 + 28 + 31 + 30 + 31,
        31 + 28 + 31 + 30 + 31 + 30,
        31 + 28 + 31 + 30 + 31 + 30 + 31,
        31 + 28 + 31 + 30 + 31 + 30 + 31 + 31,
        31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30,
        31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31,
        31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30,
        31 + 28 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30 + 31
    },
    {
        0,
        0,
        31,
        31 + 29,
        31 + 29 + 31,
        31 + 29 + 31 + 30,
        31 + 29 + 31 + 30 + 31,
        31 + 29 + 31 + 30 + 31 + 30,
        31 + 29 + 31 + 30 + 31 + 30 + 31,
        31 + 29 + 31 + 30 + 31 + 30 + 31 + 31,
        31 + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30,
        31 + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31,
        31 + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30,
        31 + 29 + 31 + 30 + 31 + 30 + 31 + 31 + 30 + 31 + 30 + 31
    }
};

time_t mytime (time_t *timer)
{
    EFI_TIME  Time;
    UINTN     Year;
	time_t		curtime;

    //
    // Get the current time and date information
    //
    gRT->GetTime (&Time, NULL);

    //
    // Years Handling
    // UTime should now be set to 00:00:00 on Jan 1 of the current year.
    //
    for (Year = 1970, curtime = 0; Year != Time.Year; Year++) {
        curtime = curtime + (time_t)(CumulativeDays[IsLeap(Year)][13] * SECSPERDAY);
    }

    //
    // Add in number of seconds for current Month, Day, Hour, Minute, Seconds, and TimeZone adjustment
    //
    curtime = curtime +
             (time_t)((Time.TimeZone != EFI_UNSPECIFIED_TIMEZONE) ? (Time.TimeZone * 60) : 0) +
             (time_t)(CumulativeDays[IsLeap(Time.Year)][Time.Month] * SECSPERDAY) +
             (time_t)(((Time.Day > 0) ? Time.Day - 1 : 0) * SECSPERDAY) +
             (time_t)(Time.Hour * SECSPERHOUR) +
             (time_t)(Time.Minute * 60) +
             (time_t)Time.Second;
	if(timer)
		*timer = curtime;

    return curtime;
}

//
// Convert a time value from type time_t to struct tm.
//
struct mytm * mygmtime (const time_t *timer, struct mytm * tm)
{
    struct mytm  *GmTime;
    UINT32     DayNo;
    UINT32     DayRemainder;
    time_t     Year;
    time_t     YearNo;
    UINT32     TotalDays;
    UINT32     MonthNo;

    if (!timer || !tm) {
        return NULL;
    }

    GmTime = tm;

    SetMem ((VOID *) GmTime, (UINTN) sizeof (struct mytm),0);

    DayNo        = (UINT32) (*timer / SECSPERDAY);
    DayRemainder = (UINT32) (*timer % SECSPERDAY);

    GmTime->tm_sec  = (int) (DayRemainder % SECSPERMIN);
    GmTime->tm_min  = (int) ((DayRemainder % SECSPERHOUR) / SECSPERMIN);
    GmTime->tm_hour = (int) (DayRemainder / SECSPERHOUR);
    GmTime->tm_wday = (int) ((DayNo + 4) % 7);

    for (Year = 1970, YearNo = 0; DayNo > 0; Year++) {
        TotalDays = (UINT32) (IsLeap (Year) ? 366 : 365);
        if (DayNo >= TotalDays) {
            DayNo -= TotalDays;
            YearNo++;
        } else {
            break;
        }
    }

    GmTime->tm_year = (int) (YearNo + (1970 - 1900));
    GmTime->tm_yday = (int) DayNo;

    for (MonthNo = 12; MonthNo > 1; MonthNo--) {
        if (DayNo >= CumulativeDays[IsLeap(Year)][MonthNo]) {
            DayNo -= (UINT32) (CumulativeDays[IsLeap(Year)][MonthNo]);
            break;
        }
    }

    GmTime->tm_mon  = (int) MonthNo;
    GmTime->tm_mday = (int) DayNo + 1;

    GmTime->tm_isdst  = 0;
    GmTime->tm_gmtoff = 0;
    GmTime->tm_zone   = NULL;

    return GmTime;
}

DWORD GetSeconds()
{
	static EFI_TIME	begintime = {0};
	EFI_STATUS	status;
	EFI_TIME	time;
	DWORD		seconds;
	
	status = gRT->GetTime(&time, NULL);
	if(begintime.Year == 0 && begintime.Month == 0)
	{
		CopyMem(&begintime, &time, sizeof(EFI_TIME));
		return 0;
	}
	
	if(time.Hour < begintime.Hour)
		seconds = time.Hour + 24 - begintime.Hour;
	else
		seconds = time.Hour - begintime.Hour;
	seconds *= 60;
	seconds = seconds + time.Minute - begintime.Minute;
	seconds *= 60;
	seconds = seconds + time.Second - begintime.Second;
	return (DWORD)seconds;
}

//根据磁盘HANDLE找到每个Partition对应子HANDLE,如果支持文件系统，则把handle填入到m_partitions[]
int CheckPartitionHandle(WORD disknumber)
{
	EFI_HANDLE diskhandle = g_disklist[disknumber].devhandle;
	EFI_STATUS status;
	UINTN i, j;
	EFI_GUID                            **ProtocolGuidArray;
	UINTN                               ArrayCount;
	EFI_OPEN_PROTOCOL_INFORMATION_ENTRY *OpenInfo;
	UINTN                               OpenInfoCount;
	UINTN                               ChildIndex;
	EFI_DEVICE_PATH_PROTOCOL *DevicePath;
	EFI_BLOCK_IO_PROTOCOL *Blkio;
	BYTE *buffer;	//[16*512];
	BYTE *buffer1;	//[16*512];

	buffer = (BYTE*)g_data.bmp;
	buffer1 = (BYTE*)g_data.bmp + 16 * 512;

	//如果这个硬盘没有格式化就不用检查了，肯定没有可用的分区
	if (g_disklist[disknumber].formatted != TRUE)
		return -1;

#if OKR_DEBUG
	MyLog(LOG_DEBUG, L"check disk %d child handle\n", disknumber);
#endif    
	/// find child handle of diskhandle
	status = gBS->ProtocolsPerHandle(
		diskhandle,
		&ProtocolGuidArray,
		&ArrayCount
	);
	if (status != 0)
		return -1;
#if OKR_DEBUG
	MyLog(LOG_DEBUG, L"CheckPartitionHandle, count %d\n", ArrayCount);
#endif    
	for (i = 0; i < ArrayCount; i++) {
		status = gBS->OpenProtocolInformation(
			diskhandle,
			ProtocolGuidArray[i],
			&OpenInfo,
			&OpenInfoCount
		);
		if (status != 0)
			continue;

		for (ChildIndex = 0; ChildIndex < OpenInfoCount; ChildIndex++) {
			EFI_HANDLE childctlhandle = OpenInfo[ChildIndex].ControllerHandle;
			EFI_SIMPLE_FILE_SYSTEM_PROTOCOL *Vol;

			if (childctlhandle == 0)
				continue;
			if (childctlhandle == diskhandle)
				continue;
			if (!(OpenInfo[ChildIndex].Attributes&EFI_OPEN_PROTOCOL_BY_CHILD_CONTROLLER))
				continue;
			status = gBS->HandleProtocol(
				childctlhandle,
				&gEfiDevicePathProtocolGuid,
				&DevicePath
			);
			//		   if (DevicePath!=0)
			//		       MyLog(LOG_DEBUG,L"child: %x, %s \n",childctlhandle,DevicePathToStr(DevicePath));
			//	       else
			//	       	MyLog(LOG_DEBUG,L"child: %x,no path\n",childctlhandle);
						//       status=gBS->HandleProtocol(childctlhandle,&gEfiSimpleFileSystemProtocolGuid,&Vol);
						//		if (EFI_ERROR(status))// no filesystem
						//		   	continue;
						//read boot sector 16 sector
			status = gBS->HandleProtocol(childctlhandle, &gEfiBlockIoProtocolGuid, (void **)&Blkio);
			if (status != 0)
				continue;
			status = Blkio->ReadBlocks(Blkio, Blkio->Media->MediaId, 0, 512 * 16, buffer);
			if (status != 0)
				continue;
#if OKR_DEBUG
			MyLog(LOG_DEBUG, L"OpenInfoCount %d, ChildIndex %d\n",
				OpenInfoCount, ChildIndex);
#endif    
			//check partitions bpb
			for (j = 0;; j++) {
				BYTE pid;
				int partindex = GetPartitionIndex(disknumber, (DWORD)j);
				if (partindex < 0)
					break;
				pid = g_Partitions[partindex].PartitionType;
				if ((pid != NTFS)/* && (pid != FAT16) && (pid != FAT32) && (pid != FAT16_E) && (pid != FAT32_E)*/)//only support fat and ntfs write file
					continue;
				//					 if (IsUnSupportedPartition(g_Partitions[partindex].PartitionType))
				//					 	continue;
#if OKR_DEBUG
				MyLog(LOG_DEBUG, L"DiskRead(%d,%d), partindex %d\n",
					disknumber, g_Partitions[partindex].BootBegin, partindex);
#endif    
				//  Print(L"DiskRead(%d,%d), partindex %d\n",disknumber,g_Partitions[partindex].BootBegin, partindex);

				if (DiskRead(disknumber, g_Partitions[partindex].BootBegin, 16, buffer1) == FALSE)
					continue;
				if (MyMemCmp(buffer, buffer1, 16 * 512) == 0)
				{
					g_Partitions[partindex].Handle = childctlhandle;
					MyLog(LOG_DEBUG, L" get partition index %d \n", partindex);
					//	MyLog(LOG_DEBUG,L" get partition index %d \n",partindex);
					break;
				}
			}
		}

		FreePool(OpenInfo);
	}

	FreePool(ProtocolGuidArray);
	return 0;
}

int CheckFatPartitionHandle(WORD disknumber)
{
    EFI_HANDLE diskhandle = g_disklist[disknumber].devhandle;
    EFI_STATUS status;
    UINTN i, j;
    EFI_GUID                            **ProtocolGuidArray;
    UINTN                               ArrayCount;
    EFI_OPEN_PROTOCOL_INFORMATION_ENTRY *OpenInfo;
 //   UINTN                               OpenInfoCount;
 //   UINTN                               ChildIndex;
    EFI_DEVICE_PATH_PROTOCOL *DevicePath;
    EFI_BLOCK_IO_PROTOCOL *Blkio;
    BYTE *buffer;	//[16*512];
    EFI_HANDLE childctlhandle;
    
    INTN               HandleFileCount,HandleFileIndex=0;   //HandleFileCount表示个数
    EFI_SIMPLE_FILE_SYSTEM_PROTOCOL   *Sfs;           //将协议加载到Sfs上
    EFI_HANDLE                        *Files=NULL;          //Files用来接收容器
    EFI_FILE_PROTOCOL         *Root;          //Root是用来打开卷的

    BYTE *buffer1;	//[16*512];

	buffer = (BYTE*)g_data.bmp;
	buffer1 = (BYTE*)g_data.bmp + 16*512;

	//如果这个硬盘没有格式化就不用检查了，肯定没有可用的分区
	if(g_disklist[disknumber].formatted != TRUE)
		return -1;
  
  // Print(L"CheckPartitionHandle\n");

 
   status=gST->BootServices->LocateHandleBuffer(
   ByProtocol,
   &gEfiSimpleFileSystemProtocolGuid,
   NULL,
   &HandleFileCount,
   &Files);
  
   if(!EFI_ERROR(status))
   {
   	  // Print(L"CheckPartitionHandle-1,HandleFileCount:%d\n",HandleFileCount);

       for(HandleFileIndex=HandleFileCount-1; HandleFileIndex > -1; --HandleFileIndex)
       {
          // 打开EFI_SIMPLE_FILE_SYSTEM_PROTOCOL 
           //将协议加载到Sfs上，这样Sfs才能打开卷
          status = gST->BootServices->HandleProtocol(
              Files[HandleFileIndex],
              &gEfiSimpleFileSystemProtocolGuid,
              (VOID**)&Sfs);

          if(status == EFI_SUCCESS)
          {
          	 childctlhandle = Files[HandleFileIndex];
             status = gBS->HandleProtocol (childctlhandle, &gEfiBlockIoProtocolGuid, (void **)&Blkio);
            if (status != 0)
                continue;
            status = Blkio->ReadBlocks( Blkio,Blkio->Media->MediaId,0,512*16,buffer);
            if (status != 0)
            	 continue;
          
            for (j=0;;j++)
            {
				        BYTE pid;
                int partindex = GetPartitionIndex(disknumber,(DWORD)j);
                if (partindex < 0)
                    break;
                pid = g_Partitions[partindex].PartitionType;
                if (/*(pid != NTFS) &&*/ (pid != FAT16) && (pid != FAT32) && (pid != FAT16_E) && (pid != FAT32_E))//only support fat
                    continue;

             //   Print(L"DiskRead(%d,%d), partindex %d\n",disknumber,g_Partitions[partindex].BootBegin, partindex);
					
                if (DiskRead(disknumber,g_Partitions[partindex].BootBegin,16,buffer1)==FALSE)
                    continue;
                if (MyMemCmp(buffer,buffer1,16*512)==0) 
                {
                    g_Partitions[partindex].Handle=childctlhandle;
                    //	MyLog(LOG_DEBUG,L" get partition index %d \n",partindex);
             //       Print(L" get partition index %d \n",partindex);
                    break;
                }
            }
          }
       }
   }  
   
   if(Files!=NULL)
   {
   	  gBS->FreePool(Files);
   }
    return 0;
}


/**
  Converting a given device to an unicode string.

  This function will dependent on gEfiDevicePathToTextProtocolGuid, if protocol
  does not installed, then return unknown device path L"?" directly.

  @param    DevPath     Given device path instance

  @return   Converted string from given device path.
  @retval   L"?"  Can not locate gEfiDevicePathToTextProtocolGuid protocol for converting.
**/
CHAR16 *
DevicePathToStr (
    IN EFI_DEVICE_PATH_PROTOCOL     *DevPath
)
{
    EFI_STATUS                       Status;
    EFI_DEVICE_PATH_TO_TEXT_PROTOCOL *DevPathToText;
    CHAR16                           *ToText = L"";

    if (DevPath == NULL) {
        return L"";
    }

    Status = gBS->LocateProtocol (
                 &gEfiDevicePathToTextProtocolGuid,
                 NULL,
                 (VOID **) &DevPathToText
             );
    if (!EFI_ERROR (Status)) {
        ToText = DevPathToText->ConvertDevicePathToText (
                     DevPath,
                     FALSE,
                     TRUE
                 );
        ASSERT (ToText != NULL);
        //  Print(L"!!!%s!!!!",ToText);
        return ToText;
    } else {
        MyLog(LOG_ERROR,L"DevicePathToTextProtocolGuid NOT Support! %d\n",Status);
    }

    return L"\\/";
}

void SmartDiskIoInit(BYTE DiskNumber, BYTE readorwrite,struct CONTINUE_RWDISK_INFO *info)
{
	mymemset(info, 0, sizeof(struct CONTINUE_RWDISK_INFO));
    info->Func = (BYTE)readorwrite;
    info->DiskNumber = DiskNumber;
}

BOOL SmartDiskIo(struct CONTINUE_RWDISK_INFO *info, UINT64 Sector, DWORD Number, BYTE *Buffer)
{
    if (!info->Number) {

        info->Sector = Sector;
        info->Number = Number;
        info->Buffer = Buffer;

	} else {

        if (Number && Sector == info->Sector + info->Number) {

            info->Number += Number;

        } else {

			DWORD count;
			BOOL ret;

			while(info->Number)
			{
				if(info->Number > 2048)
					count = 2048;
				else
					count = info->Number;

				if (info->Func == COMMAND_READ)
					ret = DiskRead((WORD)info->DiskNumber, info->Sector, count, info->Buffer);
				else if(info->Func == COMMAND_WRITE)
					ret = DiskWrite((WORD)info->DiskNumber, info->Sector, count, info->Buffer);

				if (!ret)
					break;
				info->Sector += count;
				info->Number -= count;
				info->Buffer += count * 512;
			}

            info->Sector = Sector;
            info->Number = Number;
            info->Buffer = Buffer;

			if (!ret)
			{
				//MyLog(LOG_DEBUG, L"SmartDiskIo return FALSE.\n");
				return FALSE;
			}
        }
    }

    return TRUE;
}


 

BOOL FileSystemInit(OUT PFILE_SYS_INFO info,WORD partindex,BOOL readonly)
{
	//MyLog(LOG_DEBUG, L"FileSystemInit...\n");

    EFI_STATUS status;
    SetMem(info,sizeof(FILE_SYS_INFO),0);
 
    if (g_Partitions[partindex].PartitionType==NTFS) {
        //if (g_Partitions[partindex].Handle==0)
        //    return FALSE;
        info->ifntfs=TRUE;
    } else {
        info->ifntfs=FALSE;
        if (g_Partitions[partindex].Handle==0) {//efi not support
            MyLog(LOG_DEBUG,L"FileSystemInit(%d): Not supported.\n", partindex);
            return FALSE;
        }
    }
 
    if (info->ifntfs) {
		EFI_BLOCK_IO_PROTOCOL	*blockIo = NULL;
        DWORD ret=0;
      
#ifdef NTFSLIB
		if(g_Partitions[partindex].Handle)
		{
        	status=gBS->HandleProtocol(g_Partitions[partindex].Handle, &gEfiBlockIoProtocolGuid, &blockIo);
        	if (EFI_ERROR(status))
        	{
				MyLog(LOG_DEBUG, L"HandleProtocol gEfiBlockIoProtocolGuid Error. status=%d\n", status);
        		return FALSE;
        	}
        }
        else
        {
       		WORD diskindex = g_Partitions[partindex].DiskNumber;
       		blockIo = g_disklist[diskindex].devblkIo;
        }
		 
        info->partinfo.MediaId = blockIo->Media->MediaId;
        info->partinfo.BytesPerSector = blockIo->Media->BlockSize;
        info->partinfo.BytesPerPhysicalSector = blockIo->Media->BlockSize * blockIo->Media->LogicalBlocksPerPhysicalBlock;
        if(g_Partitions[partindex].Handle)
        {
        	info->partinfo.BeginSector = 0;
	        info->partinfo.TotalSectors = blockIo->Media->LastBlock;
        }
        else
        {
        	info->partinfo.BeginSector = g_Partitions[partindex].BootBegin;
	        info->partinfo.TotalSectors = g_Partitions[partindex].TotalSectors;
        }
		 
        info->partinfo.DiskHandle = g_Partitions[partindex].Handle;
        info->partinfo.ReadBlocks = blockIo->ReadBlocks;
        info->partinfo.WriteBlocks = blockIo->WriteBlocks;
        info->partinfo.FlushBlocks = blockIo->FlushBlocks;
        info->partinfo.BlockIo = blockIo;
        
		MyLog(LOG_DEBUG, L"call n_init\n");
		ret = n_init(&info->partinfo,readonly);
		MyLog(LOG_DEBUG, L"n_init return: %d\n", ret);

        if (ret != N_SUCCESS) {
            MyLog(LOG_DEBUG,L"FileSystemInit(%d) failed with error %d.\n", (DWORD)partindex, (DWORD)ret);
            return FALSE;
        } 
		else
		{
			//MyLog(LOG_DEBUG, L"FileSystemInit return TRUE. \n");
			return TRUE;
		}
#else
        return FALSE;
#endif
	
    } else {
        EFI_SIMPLE_FILE_SYSTEM_PROTOCOL *Vol;
		 
        status=gBS->HandleProtocol(g_Partitions[partindex].Handle,&gEfiSimpleFileSystemProtocolGuid,&Vol);
        if (EFI_ERROR(status)) {
			MyLog(LOG_DEBUG,L"FileSystemInit(FAT:%d) failed with error %d.\n", (DWORD)partindex, (DWORD)status);
            return FALSE;
        }
		 
        status=Vol->OpenVolume(Vol,&info->RootFs);
		 
        if (EFI_ERROR(status)) {
            MyLog(LOG_ERROR,L"open volume error %x",status);
            return FALSE;
        }
        return TRUE;
    }
	 
}

void FileSystemClose(PFILE_SYS_INFO info)
{
#ifdef NTFSLIB

	if (NULL == info)
	{
		return;
	}

    if (info->ifntfs) {
        n_uninit(TRUE);
    }
#endif
}

//fill ntfshandle or filehandle
BOOL _FileOpen(PFILE_HANDLE_INFO Handle, CHAR16 *FileName, UINT64 OpenMode, UINT64 FileAttribute)
{
	BOOL bRet = TRUE;

    if (Handle->psys->ifntfs) {
#ifdef NTFSLIB
		DWORD status = 0;
        char asciifilename[256] = { 0 };
        
        Handle->cachesize = DEFAULT_FILE_CACHE_SIZE;
        Handle->cachedatasize = 0;
		Handle->cachedatapos = 0;
		Handle->cachedirty = FALSE;
	    Handle->cache = myalloc(Handle->cachesize);		//分配1MB大小的cache
	    
        Unicode2Ascii(asciifilename, FileName);
        if (FileAttribute & EFI_FILE_DIRECTORY) {//dir
			if (EFI_FILE_MODE_CREATE & OpenMode){
				status = n_createdir(asciifilename);
				if ((status != N_FILE_EXISTS) && (status != N_SUCCESS)){

					MyLog(LOG_DEBUG,L"ntfs_create_dir failed with error 0x%x",status);
					bRet = FALSE;
				}
			}
            Handle->ifdir = 1;
        } else {//nomal file
            status = n_openfile(asciifilename, &Handle->filehandle);
            if ((status == N_FILE_NOT_FOUND)&&(OpenMode&EFI_FILE_MODE_CREATE)) {
                if (n_createfile(asciifilename, &Handle->filehandle)!=N_SUCCESS) 
                {
                    //chenzg1
                	/* MyLog(LOG_DEBUG,L"n_createfile_unicode,%s",FileName);
                	 getch();
                   if(n_createfile_unicode(asciifilename,FileName,StrLength(FileName),&Handle->filehandle)!=N_SUCCESS)
					         {
					         	 MyLog(LOG_DEBUG,L"ntfs_create_file failed.%s",FileName);
                     bRet = FALSE;
                   }
                  
                  {
                  
                  	 unsigned char *tmp="ab123.lnk";
                  	unsigned char test3[] = {0xef,0xbb,0xbf,0xe4,0xb8,0xa5,0x2e,0x65,0x78,0x65,0x00 };
                  	unsigned char test6[] = {0xc1,0xeb,0x2e,0x65,0x78,0x65,0x00 };
                  	unsigned char test10[] = {0xef,0xbb,0xbf,0xe8,0x81,0x94,0x2e,0x65,0x78,0x65,0x00 };
                  	unsigned char test4[] = {0x61,0x61,0x62,0x31,0x32,0x33,0x2e,0x65,0x78,0x65,0x00 };
                  	unsigned char tempfile11[]={0x61,0xef,0xbb,0xbf,0x61,0x62,0x32,0x33,0x34,0x2e,0x6c,0x6e,0x6b,0x00};
                  		DWORD ret=N_SUCCESS;
	NFILE file=NULL;

	ret=n_createfile_unicode((L"\\Users\\联想软件与驱动安装.lnk"),sizeof(L"\\Users\\联想软件与驱动安装.lnk")/2-1,&file);
	if(NSUCCEED(ret)&&file)
	{
		MyLog(LOG_DEBUG,L"n_createfile1 sucess.");
		n_closefile(file);
	}
	else
	{
		MyLog(LOG_DEBUG,L"create file1 failed,ret=0x%lx,%lu\n",ret,ret);
	//	Print(L"create file failed,ret=0x%lx,%lu\n",ret,ret);
	}



                  }
                  */
                }
            } else if (status != N_SUCCESS) {
                MyLog(LOG_DEBUG,L"ntfs_open_file failed with error 0x%x",status);
				bRet = FALSE;
            }
        }
#else
		bRet = FALSE;
#endif
    } else {
		EFI_STATUS status;
        EFI_FILE_PROTOCOL * RootFs=Handle->psys->RootFs;

        status = RootFs->Open(RootFs, &Handle->filehandle, FileName, OpenMode, FileAttribute);
        if (EFI_ERROR(status)) {
			MyLog(LOG_DEBUG, L"OpenFile failed with error 0x%x", status);
			bRet = FALSE;
        }
    }
	//MyLog(LOG_DEBUG, L"_FileOpen: %d\n", bRet);
	return bRet;
}

BOOL FileDelete(PFILE_SYS_INFO info, CHAR16 *filename)
{
	char asciifilename[256] = { 0 };
	
	if (info->ifntfs) {
		Unicode2Ascii(asciifilename,filename);
		if(n_deletefile(asciifilename) == 0)
			return TRUE;
	} else {
		FILE_HANDLE_INFO filehandle;
		if (FileOpen(info,&filehandle,filename,EFI_FILE_MODE_CREATE|EFI_FILE_MODE_WRITE|EFI_FILE_MODE_READ,0,TRUE)) {
			EFI_STATUS status;
			EFI_FILE_PROTOCOL * RootFs = filehandle.psys->RootFs;
			status = RootFs->Delete(filehandle.filehandle);
			if (!EFI_ERROR(status)) {
				return TRUE;
			} else {
				FileClose(&filehandle);
			}
		}
	}
	
	return FALSE;
}

BOOL FileGetSize(PFILE_HANDLE_INFO handle, UINT64 *FileSize)
{
	if (handle->psys->ifntfs) {
		if(n_getfilesize(handle->filehandle, FileSize) == N_SUCCESS)
			return TRUE;
	} else {
		BYTE buffer[1024] = { 0 };
		EFI_STATUS status;
		EFI_FILE_PROTOCOL * RootFs = handle->psys->RootFs;
		EFI_FILE_INFO *info = (EFI_FILE_INFO *)buffer;
		UINTN infosize = 1024;

		//,EFI_FILE_INFO_ID
		status = RootFs->GetInfo(handle->filehandle, &gEfiFileInfoGuid, &infosize, info);
		if (!EFI_ERROR(status)) {
			*FileSize = info->FileSize;
			return TRUE;
		}
	}
	return FALSE;
}

BOOL GetFileSizeByName(IN PFILE_SYS_INFO info,CHAR16 *filename,UINT64 *FileSize)
{
	FILE_HANDLE_INFO handle;
	BOOL bRet = FALSE;

	if(FileSize)
		*FileSize = 0;	//先清0

	if (!FileOpen(info, &handle, filename, EFI_FILE_MODE_READ, 0, FALSE)) {
		return FALSE;
	}

	bRet = FileGetSize(&handle, FileSize);

	FileClose(&handle);

	return bRet;
}

//support directry,create file or dir.attribute use EFI system define
//ifneedseg, true=support file segments
BOOL FileOpen(IN PFILE_SYS_INFO info,OUT PFILE_HANDLE_INFO handle,CHAR16 *filename,UINT64 openmode,UINT64 attribute,BOOL ifneedseg)
{
    EFI_STATUS status;

    SetMem(handle,sizeof(FILE_HANDLE_INFO),0);
    handle->psys=info;
    
    if (handle->psys->ifntfs)
    	handle->ifneedseg= FALSE;
    else
    	handle->ifneedseg=ifneedseg;

    StrnCpy(handle->filename,filename,sizeof(handle->filename)/sizeof(CHAR16));

    return _FileOpen(handle,filename,openmode,attribute);
}

BOOL SegFileOpen(IN PFILE_SYS_INFO info,OUT PFILE_HANDLE_INFO handle,CHAR16 *filename,UINT64 openmode,UINT64 attribute,BOOL ifneedseg)
{
    EFI_STATUS status;

    SetMem(handle,sizeof(FILE_HANDLE_INFO),0);
    handle->psys=info;
    
  //  if (handle->psys->ifntfs)
  //  	handle->ifneedseg= FALSE;
  //  else
  //  	handle->ifneedseg=ifneedseg;

   	handle->ifneedseg=ifneedseg;

    StrnCpy(handle->filename,filename,sizeof(handle->filename)/sizeof(CHAR16));

    return _FileOpen(handle,filename,openmode,attribute);
}



BOOL SegFileRead( PFILE_HANDLE_INFO handle,OUT UINTN * size, PBYTE buffer )
{
	  //MY_DEFINE_BUFFER_SIZE
	  UINTN index = 0;
	  UINTN buffersize = 0;
	  EFI_STATUS status;
 
	  if( (*size) < MY_DEFINE_BUFFER_SIZE )
	  {
	  	  status = handle->psys->RootFs->Read(handle->filehandle,size,buffer);        
        if (EFI_ERROR(status)) 
        {
            MyLog(LOG_ERROR,L"SegFileRead failed with error 0x%x.",status);
            return FALSE;
        } else
            return TRUE;
	  }
	  
	  for(index=0;index < (*size);)
	  {
	  	  buffersize = MY_DEFINE_BUFFER_SIZE;
	  	  
	  	  if( (index+MY_DEFINE_BUFFER_SIZE) >= (*size) )
	  	  {
	  	  	 buffersize = (*size) - index;
	  	  }
	  	  	  	  
	  		status = handle->psys->RootFs->Read(handle->filehandle,&buffersize,g_read_seg_buffer);        
        if (EFI_ERROR(status)) 
        {
            (*size) = index;     
            MyLog(LOG_ERROR,L"SegFileRead failed error 0x%x.",status);
            return FALSE;
        } 
	  	  
 	  	  CopyMem(buffer+index,g_read_seg_buffer,buffersize);

	  	  index += buffersize;
	  }
	  
	  return TRUE;	  
	  
}

BOOL _FileRead(PFILE_HANDLE_INFO handle, OUT UINTN * size, PBYTE buffer)
{
    EFI_STATUS status;
    if (handle->psys->ifntfs) {
#ifdef NTFSLIB
		UINT64 total = *size;
        UINT64 readsize = *size;
        DWORD status;
        if (handle->ifdir) {
			DIR_LIST * listbuffer = NULL;
            EFI_FILE_INFO *fileinfo = (EFI_FILE_INFO *)buffer;

           	listbuffer = (DIR_LIST *)handle->cache;
			if(!handle->cachedatasize)
			{
	            char asciifilename[256] = { 0 };
	            UINT64 buffersize = DEFAULT_FILE_CACHE_SIZE;
	            
            	Unicode2Ascii(asciifilename,handle->filename);
            	status = n_listdir(asciifilename, &buffersize, listbuffer);
            	if (status!=N_SUCCESS) {
#if OKR_DEBUG
                	MyLog(LOG_DEBUG,L"list dir error %x",status);
#endif
					*size=0;
            	    return FALSE;
            	}
            	
            	handle->cachedatasize = buffersize;
            }

            if (listbuffer->count <= handle->filepos) {//end
                *size=0;
                return TRUE;
            }
            fileinfo->FileSize = listbuffer->entry[handle->filepos].filesize;
            Ascii2Unicode(fileinfo->FileName, listbuffer->entry[handle->filepos].name);
            *size = sizeof(EFI_FILE_INFO) + StrLength(fileinfo->FileName);

            handle->filepos++;
            return TRUE;

        } else {
			UINT64 offset = 0;
			UINT64 count = 0;
			
			*size = 0;
			while(total)
			{
				if(handle->filepos & 511)
				{
					//MyLog(LOG_DEBUG,L"list filepos %x",handle->filepos);
					if(handle->cachedatapos > handle->filepos 
						|| handle->cachedatapos + handle->cachedatasize < handle->filepos)
					{
						//不在cache中，读取文件到cache里
						handle->cachedatapos = (handle->filepos & ~0xfff);	//对齐4K

  	        MyLog(LOG_DEBUG,L"n_readfile - 1");

						status = n_readfile(handle->filehandle, handle->cachedatapos, 
									handle->cachesize, handle->cache, &count);
		    	        if (status != N_SUCCESS|| count == 0xFFFFFFFFFFFFFFFF) {
        			        MyLog(LOG_DEBUG,L"ReadFile failed with error %x",status);
		    	            return FALSE;
		    	        }
        				  	  	        MyLog(LOG_DEBUG,L"n_readfile - 1 - over");

						handle->cachedatasize = count;
		    	        if(count == 0)
		    	        	break;
						GoProcessBar(count);
					}
				}
				
				if(handle->cachedatapos <= handle->filepos 
						&& handle->cachedatapos + handle->cachedatasize > handle->filepos)
				{
					offset = handle->filepos - handle->cachedatapos;
					count = handle->cachedatasize - offset;
					count = (total > count) ? count : total;
					CopyMem(buffer, handle->cache + offset, count);
					*size += count;
					buffer += count;
					handle->filepos += count;
					total -= count;
				}
				
				if(total)
				{
       				readsize = (total & ~(handle->cachesize - 1));	//因为cache大小最大64K，所以可以对齐64K
       				while(readsize)
       				{
       					if(readsize > 16*1024*1024)
       						count = 16*1024*1024;
       					else
       						count = readsize;
       						

        				status = n_readfile(handle->filehandle, handle->filepos, count, buffer, &count);
		    	        if ( status!=N_SUCCESS || count == 0xFFFFFFFFFFFFFFFF ) {
        			        MyLog(LOG_ERROR,L"ReadFile2 failed with error %x",status);
		    	            return FALSE;
		    	        }
		    	         
     
		    	        if(count == 0)
		    	        {
		    	        	total = 0;
		    	        	break;
		    	        }
        
       					GoProcessBar(count);
      
  				
        				buffer += count;
	    			    handle->filepos += count;
        				readsize -= count;
    				    total -= count;
        				*size += count;
        			}
        			
        			if(total)
        			{
        				

						status = n_readfile(handle->filehandle, handle->filepos, 
									handle->cachesize, handle->cache, &count);
		    	        if (status!=N_SUCCESS|| count == 0xFFFFFFFFFFFFFFFF) {
        			        MyLog(LOG_DEBUG,L"ReadFile3 failed with error %x",status);
		    	            return FALSE;
		    	        }

						handle->cachedatasize = count;
						handle->cachedatapos = handle->filepos;
						//handle->filepos += total;, 此时数据还没有拷贝到buffer中，所以filepos不能改，会再次循环，从而修正filepos
		    	        if(count == 0)
		    	        	break;
						GoProcessBar(count);
        			}
        		}
        	}
            return TRUE;
        }
#else
        return FALSE;
#endif
    } else {

    
      	return SegFileRead(handle,size,buffer);
/*
        status = handle->psys->RootFs->Read(handle->filehandle,size,buffer);

        if (EFI_ERROR(status)) {
            MyLog(LOG_DEBUG,L"read file error %x",status);
            return FALSE;
        } else
            return TRUE;
*/   
    }
}


BOOL SegFileWrite( PFILE_HANDLE_INFO handle,OUT UINTN * size, PBYTE buffer )
{
	  //MY_DEFINE_BUFFER_SIZE
	  UINTN index = 0;
	  UINTN buffersize = 0;
	  EFI_STATUS status;
 
	  if( (*size) < MY_DEFINE_BUFFER_SIZE )
	  {
	  	  status = handle->psys->RootFs->Write(handle->filehandle,size,buffer);        
        if (EFI_ERROR(status)) 
        {
            MyLog(LOG_ERROR,L"SegFileWrite failed with error 0x%x.",status);
            return FALSE;
        } else
            return TRUE;
	  }
	  
	  for(index=0;index < (*size);)
	  {
	  	  buffersize = MY_DEFINE_BUFFER_SIZE;
	  	  
	  	  if( (index+MY_DEFINE_BUFFER_SIZE) >= (*size) )
	  	  {
	  	  	 buffersize = (*size) - index;
	  	  }
	  	  
	  	  CopyMem(g_seg_buffer,buffer+index,buffersize);
	  	  
	  		status = handle->psys->RootFs->Write(handle->filehandle,&buffersize,g_seg_buffer);        
        if (EFI_ERROR(status)) 
        {
            (*size) = index;     
            MyLog(LOG_ERROR,L"SegFileWrite failed error 0x%x.",status);
            return FALSE;
        } 
	  	  index += buffersize;
	  }
	  
	  return TRUE;	  
	  
}

BOOL _FileWrite(PFILE_HANDLE_INFO handle,OUT UINTN * size, PBYTE buffer)
{
    EFI_STATUS status;
    if (handle->psys->ifntfs) {
#ifdef NTFSLIB
        UINT64 total = *size;
        UINT64 writesize = total;
        UINT64 count;
        DWORD status;
        
        if (handle->ifdir)
            return FALSE;
		*size = 0;
        if(handle->cachedatasize)
        {
			//如果当前文件指针超出cache范围，先将当前cache中的数据写入文件中
			if(handle->filepos != handle->cachedatapos + handle->cachedatasize) {


				status = n_writefile(handle->filehandle,handle->cachedatapos, handle->cachedatasize, handle->cache, &writesize);
	    	if (status!=N_SUCCESS|| writesize == 0xFFFFFFFFFFFFFFFF) 
	      {
    	      MyLog(LOG_ERROR,L"_FileWrite0 failed with error %x",status);
        		return FALSE;
        }
            	
				handle->cachedatasize = 0;
				handle->cachedatapos = handle->filepos;
				writesize = total;
			}

        	if(writesize > handle->cachesize - handle->cachedatasize)
        		writesize = handle->cachesize - handle->cachedatasize;
        	CopyMem(handle->cache + handle->cachedatasize, buffer, writesize);
        	handle->cachedatasize += writesize;
       		total -= writesize;
       		buffer += writesize;
       		*size += writesize;
        	if(handle->cachedatasize == handle->cachesize)
        	{

        		status = n_writefile(handle->filehandle, handle->cachedatapos, handle->cachedatasize, handle->cache, &writesize);
	    	    if (status!=N_SUCCESS|| writesize == 0xFFFFFFFFFFFFFFFF) {
    	    	    MyLog(LOG_ERROR,L"_FileWrite failed with error %x",status);
            		return FALSE;
            	}

    				handle->cachedatapos += handle->cachedatasize;
        		handle->filepos = handle->cachedatapos;
        		handle->cachedatasize = 0;
        		handle->cachedirty = FALSE;
        	}
        	else
        	{
        		handle->cachedirty = TRUE;
				handle->filepos += writesize;
        		return TRUE;
        	}
        }
        
       	writesize = (total & ~(handle->cachesize - 1));	//因为cache大小最大64K，所以可以对齐64K
       	while(writesize)
       	{
       		if(writesize > 16*1024*1024)
       			count = 16*1024*1024;
       		else
       			count = writesize;


        	status = n_writefile(handle->filehandle, handle->filepos, count, buffer, &count);
	    	if (status!=N_SUCCESS|| count == 0xFFFFFFFFFFFFFFFF) {
    	        MyLog(LOG_ERROR,L"_FileWrite2 failed with error %x",status);
            	return FALSE;
            }

        	writesize -= count;
       		GoProcessBar(count);
        	
        	buffer += count;
	        handle->filepos += count;
    	    total -= count;
        	*size += count;
        }

        if(total)
        {
        	CopyMem(handle->cache, buffer, total);
        	handle->cachedatasize = total;
			handle->cachedatapos = handle->filepos;
			handle->filepos += total;
       		handle->cachedirty = TRUE;
	        *size += total;
        }
		return TRUE;
#else
        return FALSE;
#endif
    } else {
    	
    	
    	return SegFileWrite(handle,size,buffer);
//        status = handle->psys->RootFs->Write(handle->filehandle,size,buffer);        
//        if (EFI_ERROR(status)) 
//        {
//            MyLog(LOG_ERROR,L"_FileWrite3 failed with error 0x%x.",status);
//            return FALSE;
//        } else
//            return TRUE;
    }
}

//当遇到文件末尾时，可能出现size不等于初始值，或为0的情况(分段文件可能不等，但不会0)
//其余都会相同。或返回FALSE
BOOL FileRead_kang_del(PFILE_HANDLE_INFO handle,OUT UINTN * size, PBYTE buffer)
{
    EFI_STATUS status;
    UINTN readsize=*size;
    if (handle->ifeof) {
        *size=0;
        return TRUE;
    }
    if (_FileRead(handle,&readsize,buffer)==FALSE)
        return FALSE;

    if (handle->ifneedseg&&(readsize==0)) {
		//read next file
        CHAR16 namebuffer[100] = { 0 };
        handle->currentfileseg++;
        SPrint(namebuffer,200,L"%s.%d",handle->filename,(UINTN)handle->currentfileseg);
        FileClose(handle);
#if OKR_DEBUG
        MyLog(LOG_DEBUG,L"read next file %s\n",namebuffer);
#endif
        if (_FileOpen(handle,namebuffer,EFI_FILE_MODE_READ,0)==FALSE) {
            handle->ifeof=TRUE;
            *size=0;
            return TRUE;
        }
        readsize=*size;
        if (_FileRead(handle,&readsize,buffer)==FALSE)
            return FALSE;
        *size=readsize;
    } else {
        *size=readsize;
    }
    return TRUE;

}
DWORD	OldStructSize = 0;
int OldImage = 0;			////备份文件是否为旧版本。1：旧版本（0x09000810，AppVer: 9.2.0）。 0：新版本（0x09000811）。
BOOL FileRead(PFILE_HANDLE_INFO handle,OUT UINTN * size, PBYTE buffer)
{
	EFI_STATUS status;
	UINTN readsize = *size;
	PBYTE Buff = NULL;
	OKR_HEADER_810 *OldHeader = NULL;
	OKR_HEADER *NewHeader = NULL;
    if (handle->ifeof) {
        *size=0;
        return TRUE;
    }
    if (_FileRead(handle,&readsize,buffer)==FALSE)
        return FALSE;

    if (handle->ifneedseg&&(readsize==0)) {
		//read next file
        CHAR16 namebuffer[100] = { 0 };
        handle->currentfileseg++;
        SPrint(namebuffer,200,L"%s.%d",handle->filename,(UINTN)handle->currentfileseg);
        FileClose(handle);
#if OKR_DEBUG
        MyLog(LOG_DEBUG,L"read next file %s\n",namebuffer);
#endif
        if (_FileOpen(handle,namebuffer,EFI_FILE_MODE_READ,0)==FALSE) {
            handle->ifeof=TRUE;
            *size=0;
            return TRUE;
        }
        readsize=*size;
        if (_FileRead(handle,&readsize,buffer)==FALSE)
            return FALSE;
        *size=readsize;
    } else {
        *size=readsize;
    }
	OldStructSize = 0;
	OldImage =0;
	//kang+++++++>
	
	/*
typedef struct OKR_HEADER {     //old

    DWORD	Magic;				//0, 'okr9'
    DWORD	Version;			//4, 
    DWORD	StructSize;			//8, 本结构大小，包括可变长度的分区信息
    DWORD	Time;				//0xC
    BYTE	Memo[240];			//0x10
	BYTE	bOkrPE;				//0x100, 是否PE下的备份
    BYTE	reserved[3];		//0x101
	DWORD	TimeZone;			//0x104, 时区，多少秒
    UINT64	FileSize;			//0x108, 所有备份文件大小（如果没有切分，就等于本文件大小；否则是所有切分的文件大小之和），字节数
    UINT64	Disksize;			//0x110, 备份的硬盘大小
//kang--	BYTE    SourceDiskGUID[16];
//kang--	BYTE	WinPartNtfsGuid[16];		//0x180 12 个扇区
//kang--	BYTE	Reserved_2[1024];		//0x180 12 个扇区
    WORD	PartitionIndex;		//0x118, 备份文件所在分区的index，runtime用
    WORD	PartitionCount;		//0x11A, 备份时检测到的有效分区个数，即本结构中可变长度成员变量Partition的个数
    DWORD	GptSize;			//0x11C, GPT分区表备份区域大小, 0-34扇区，IN BYTE
    BYTE	bGpt;				//0x120
    BYTE	bComplete;			//0x121, 备份结束后值1
    BYTE	bCompress;			//0x122, 数据区是否压缩
    BYTE	bFactoryBackup;		//0x123, 是否工厂备份, 必然在服务分区里，如果没有工厂备份，则第一次备份为工厂备份，工厂备份不可被删除
    DWORD	CompressBlockSize;	//0x124, 每100M压缩一次，必须被缓冲区大小整除
    UINT64	OriginalSize;		//0x128 - 0x130, 原始备份数据区字节数，备份后生成精确,压缩前的大小
	DWORD	DataOffset;			//0x130,	备份数据偏移地址，以字节为单位
	DWORD	FileNumber;			//0x134, 备份的镜像文件的个数
	ULONGLONG FileTime;			//0x138, 文件的日期
    BYTE	Reserved[0x40];		//0x140
	BYTE	FileName[0x80];		//0x180
//kang--	BYTE	TempBuffer[6144];		//0x180 12 个扇区
    WIN32_PARTITIONINFO Partition[1];	//0x200 + 0xb0*64
}OKR_HEADER, *POKR_HEADER;	


typedef struct OKR_HEADER {

    DWORD	Magic;				//0, 'okr9'
    DWORD	Version;			//4, 
    DWORD	StructSize;			//8, 本结构大小，包括可变长度的分区信息
    DWORD	Time;				//0xC
    BYTE	Memo[240];			//0x10
	BYTE	bOkrPE;				//0x100, 是否PE下的备份
    BYTE	reserved[3];		//0x101
	DWORD	TimeZone;			//0x104, 时区，多少秒
    UINT64	FileSize;			//0x108, 所有备份文件大小（如果没有切分，就等于本文件大小；否则是所有切分的文件大小之和），字节数
    UINT64	Disksize;			//0x110, 备份的硬盘大小
	BYTE    SourceDiskGUID[16];
	BYTE	WinPartNtfsGuid[16];		//0x180 12 个扇区
	BYTE	Reserved_2[1024];		//0x180 12 个扇区
    WORD	PartitionIndex;		//0x118, 备份文件所在分区的index，runtime用
    WORD	PartitionCount;		//0x11A, 备份时检测到的有效分区个数，即本结构中可变长度成员变量Partition的个数
    DWORD	GptSize;			//0x11C, GPT分区表备份区域大小, 0-34扇区，IN BYTE
    BYTE	bGpt;				//0x120
    BYTE	bComplete;			//0x121, 备份结束后值1
    BYTE	bCompress;			//0x122, 数据区是否压缩
    BYTE	bFactoryBackup;		//0x123, 是否工厂备份, 必然在服务分区里，如果没有工厂备份，则第一次备份为工厂备份，工厂备份不可被删除
    DWORD	CompressBlockSize;	//0x124, 每100M压缩一次，必须被缓冲区大小整除
    UINT64	OriginalSize;		//0x128 - 0x130, 原始备份数据区字节数，备份后生成精确,压缩前的大小
	DWORD	DataOffset;			//0x130,	备份数据偏移地址，以字节为单位
	DWORD	FileNumber;			//0x134, 备份的镜像文件的个数
	ULONGLONG FileTime;			//0x138, 文件的日期
    BYTE	Reserved[0x40];		//0x140
	BYTE	FileName[0x80];		//0x180
	BYTE	TempBuffer[6144];		//0x180 12 个扇区
    WIN32_PARTITIONINFO Partition[1];	//0x200 + 0xb0*64
}OKR_HEADER, *POKR_HEADER;



	*/
	if(((OKR_HEADER_810 *) buffer)->Magic == OKR_IMAGE_MAGIC &&  ((OKR_HEADER_810 *)buffer)->Version == 0x09000810 )
	{
		OldImage = 1;
		
		
		 Buff=AllocateZeroPool(OKR_HEADER_MAX_SIZE);
		 OldHeader =(OKR_HEADER_810 *) buffer;
		 NewHeader = (OKR_HEADER *)Buff ;
		NewHeader->Magic = OldHeader->Magic;				//0, 'okr9'
    NewHeader->Version 		= OKR_VERSION    ;//4, 
    NewHeader->StructSize 	= ((FIELD_OFFSET(OKR_HEADER, Partition) + OldHeader->PartitionCount * sizeof(WIN32_PARTITIONINFO) + SECTOR_SIZE - 1) & ~(SECTOR_SIZE - 1)); 	//8, 本结构大小，包括可变长度的分区信息
  
	 OldStructSize = OldHeader->StructSize;
		     MyLog(LOG_DEBUG,L"\r\nOld StructSize =%x \n",OldHeader->StructSize);
            MyLog(LOG_DEBUG,L"\r\nnew StructSize =%x \n",NewHeader->StructSize);
		//	gBS->Stall(0x100000);
	 
		
  NewHeader->Time 		= OldHeader->Time   ;	//0xC
